; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared5 - mode
	thermograph0 - mode
	thermograph3 - mode
	spectrograph4 - mode
	thermograph2 - mode
	infrared1 - mode
	Star0 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Star1 - direction
	Star4 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 infrared1)
	(supports instrument3 infrared5)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(pointing satellite1 Star4)
	(have_image Planet7 infrared1)
	(have_image Planet7 spectrograph4)
	(have_image Star8 infrared1)
	(have_image Star8 thermograph3)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 infrared5)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 spectrograph4)
	(have_image Phenomenon11 thermograph3)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon12 thermograph3)
))

)

; plan
1. (turn_to satellite1 star4 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star4)
   goals met: 1 of 13
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 13
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 1 of 13
4. (turn_to satellite1 star8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star8)
   goals met: 0 of 13
5. (take_image satellite1 star8 instrument3 infrared1)
   added: (have_image star8 infrared1)
   goals met: 1 of 13
6. (turn_to satellite1 planet7 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet7)
   goals met: 1 of 13
7. (take_image satellite1 planet7 instrument3 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 13
9. (take_image satellite1 phenomenon10 instrument3 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 3 of 13
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 13
11. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 3 of 13
12. (take_image satellite1 phenomenon10 instrument3 infrared5)
   added: (have_image phenomenon10 infrared5)
   goals met: 4 of 13
13. (turn_to satellite0 phenomenon11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 13
14. (take_image satellite0 phenomenon11 instrument0 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 5 of 13
15. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 6 of 13
16. (take_image satellite0 phenomenon12 instrument0 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 7 of 13
17. (turn_to satellite0 planet7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet7)
   goals met: 6 of 13
18. (take_image satellite0 planet7 instrument0 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 7 of 13
19. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 7 of 13
20. (take_image satellite0 planet9 instrument0 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 8 of 13
21. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 8 of 13
22. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 8 of 13
23. (turn_to satellite0 groundstation3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation3)
   goals met: 8 of 13
24. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 8 of 13
25. (turn_to satellite0 phenomenon11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon11)
   goals met: 8 of 13
26. (take_image satellite0 phenomenon11 instrument1 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 9 of 13
27. (turn_to satellite0 star8 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star8)
   goals met: 9 of 13
28. (take_image satellite0 star8 instrument1 thermograph3)
   added: (have_image star8 thermograph3)
   goals met: 10 of 13
29. (turn_to satellite0 phenomenon12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon12)
   goals met: 11 of 13
30. (take_image satellite0 phenomenon12 instrument1 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 12 of 13
31. (turn_to satellite1 star4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star4)
   goals met: 13 of 13
